[
  {
    "NODE_ID": "A01",
    "NODE_TYPE": "canon",
    "TEXT": "IN HIS \"A HISTORY OF THE WORLD WAR (PAGE 212),\" CAPTAIN LIDDELL HART REPORTS THAT A PLANNED OFFENSIVE BY THIRTEEN BRITISH DIVISIONS, SUPPORTED BY FOURTEEN HUNDRED ARTILLERY PIECES, AGAINST THE GERMAN LINE AT SERRE-MONTAUBAN, SCHEDULED FOR JULY 24, 1916, HAD TO BE POSTPONED UNTIL THE MORNING OF THE 29TH. HE COMMENTS THAT TORRENTIAL RAIN CAUSED THIS DELAY - WHICH LACKED ANY SPECIAL SIGNIFICANCE. THE FOLLOWING DEPOSITION, DICTATED BY, READ OVER, AND THEN SIGNED BY DR. YU TSUN, FORMER TEACHER OF ENGLISH AT THE TSINGTAO HOCHSCHULE, CASTS UNSUSPECTED LIGHT UPON THIS EVENT. THE FIRST TWO PAGES ARE MISSING."
  },
  {
    "NODE_ID": "A02",
    "NODE_TYPE": "canon",
    "TEXT": ". . . AND I HUNG UP THE PHONE. IMMEDIATELY I RECOLLECTED THE VOICE THAT HAD SPOKEN IN GERMAN. IT WAS THAT OF CAPTAIN RICHARD MADDEN. MADDEN, IN VIKTOR RUNEBERG'S OFFICE, MEANT THE END OF ALL OUR WORK AND - THOUGH THIS SEEMED A SECONDARY MATTER, OR SHOULD HAVE SEEMED SO TO ME - OF OUR LIVES ALSO. HIS BEING THERE MEANT THAT RUNEBERG HAD BEEN ARRESTED OR MURDERED. BEFORE THE SUN SET ON THIS SAME DAY, I RAN THE SAME RISK. MADDEN WAS IMPLACABLE. RATHER, TO BE MORE ACCURATE, HE WAS OBLIGED TO BE IMPLACABLE. AN IRISHMAN IN THE SERVICE OF ENGLAND, A MAN SUSPECTED OF EQUIVOCAL FEELINGS IF NOT OF ACTUAL TREACHERY, HOW COULD HE FAIL TO WELCOME AND SEIZE UPON THIS EXTRAORDINARY PIECE OF LUCK: THE DISCOVERY, CAPTURE AND PERHAPS THE DEATHS OF TWO AGENTS OF IMPERIAL GERMANY?"
  },
  {
    "NODE_ID": "A03",
    "NODE_TYPE": "canon",
    "TEXT": "I WENT UP TO MY BEDROOM. ABSURD THOUGH THE GESTURE WAS, I CLOSED AND LOCKED THE DOOR. I THREW MYSELF DOWN ON MY NARROW IRON BED, AND WAITED ON MY BACK. THE NEVER CHANGING ROOFTOPS FILLED THE WINDOW, AND THE HAZY SIX O'CLOCK SUN HUNG IN THE SKY. IT SEEMED INCREDIBLE THAT THIS DAY, A DAY WITHOUT WARNINGS OR OMENS, MIGHT BE THAT OF MY IMPLACABLE DEATH. IN DESPITE OF MY DEAD FATHER, IN DESPITE OF HAVING BEEN A CHILD IN ONE OF THE SYMMETRICAL GARDENS OF HAI FENG, WAS I TO DIE NOW? \n\nTHEN I REFLECTED THAT ALL THINGS HAPPEN, HAPPEN TO ONE, PRECISELY NOW. CENTURY FOLLOWS CENTURY, AND THINGS HAPPEN ONLY IN THE PRESENT. THERE ARE COUNTLESS MEN IN THE AIR, ON LAND AND AT SEA, AND ALL THAT REALLY HAPPENS HAPPENS TO ME . . . THE ALMOST UNBEARABLE MEMORY OF MADDEN'S LONG HORSEFACE PUT AN END TO THESE WANDERING THOUGHTS. \n\nIN THE MIDST OF MY HATRED AND TERROR (NOW THAT IT NO LONGER MATTERS TO ME TO SPEAK OF TERROR, NOW THAT I HAVE OUTWITTED RICHARD MADDEN, NOW THAT MY NECK HANKERS FOR THE HANGMAN'S NOOSE), I KNEW THAT THE FAST-MOVING AND DOUBTLESS HAPPY SOLDIER DID NOT SUSPECT THAT I POSSESSED THE SECRET - THE NAME OF THE EXACT SITE OF THE NEW BRITISH ARTILLERY PARK ON THE ANCRE. A BIRD STREAKED ACROSS THE MISTY SKY AND, ABSENTLY, I TURNED IT INTO AN AIRPLANE AND THEN THAT AIRPLANE INTO MANY IN THE SKIES OF FRANCE, SHATTERING THE ARTILLERY PARK UNDER A RAIN OF BOMBS. IF ONLY MY MOUTH, BEFORE IT SHOULD BE SILENCED BY A BULLET, COULD SHOUT THIS NAME IN SUCH A WAY THAT IT COULD BE HEARD IN GERMANY ... MY VOICE, MY HUMAN VOICE, WAS WEAK. HOW COULD IT REACH THE EAR OF THE CHIEF? THE EAR OF THAT SICK AND HATEFUL MAN WHO KNEW NOTHING OF RUNEBERG OR OF ME EXCEPT THAT WE WERE IN STAFFORDSHIRE. A MAN WHO, SITTING IN HIS ARID BERLIN OFFICE, LEAFED INFINITELY THROUGH NEWSPAPERS, LOOKING IN VAIN FOR NEWS FROM US."
  },
  {
    "NODE_ID": "B_A03",
    "NODE_TYPE": "BRANCH B",
    "TEXT": "I lay upon the iron bed and understood that the simplest solution was already within my hand.\n\nThe revolver contained one bullet. It would suffice.\n\nMadden would arrive. I would be found dead. The Secret would perish with me. England would remain ignorant of my intention, and Germany would remain ignorant of my loyalty.\n\nDeath is exact. It resolves hesitation. For a moment, I believed that by destroying myself I would destroy the labyrinth."
  },
  {
    "NODE_ID": "B_A03_01",
    "NODE_TYPE": "",
    "TEXT": "I placed the revolver against my temple. The metal was cool and impersonal.\n\nI began to tighten my finger. But in that instant, another thought intruded — not fear of death, but fear of futility.\n\nIf I died, the name would remain unspoken. The artillery park would endure. The Chief would conclude not that I had been brave, but that I had failed.\n\nSuicide would silence me; it would not speak for me. There are deaths that communicate and deaths that vanish.\n\nThis would vanish.\n\nThe bullet trembled beneath my finger."
  },
  {
    "NODE_ID": "B_A03_02",
    "NODE_TYPE": "",
    "TEXT": "I pulled the trigger."
  },
  {
    "NODE_ID": "B_A03_02.5",
    "NODE_TYPE": "",
    "TEXT": "The chamber answered with a dry metallic click. The bullet had not been chambered. For several seconds I remained motionless.\n\nThe revolver had offered me a rehearsal. It had reminded me that death, like courage, requires precision. I lowered the weapon.\n\nThe Secret still lived. Madden was still coming. The necessity had not diminished."
  },
  {
    "NODE_ID": "B_A03_03",
    "NODE_TYPE": "",
    "TEXT": "If the bullet must be used, I thought, it must serve purpose. \n\nI stood. To die here would simplify matters excessively.\n\nTo kill myself would prove nothing. But to die in a manner that spoke — that would be different.\n\nThe bullet must pronounce a name. The plan began to assume shape."
  },
  {
    "NODE_ID": "B_A03_04",
    "NODE_TYPE": "",
    "TEXT": "I set the revolver aside. Death is irrevocable; delay is reversible. I told myself that I would die later, after transmitting the Secret. This compromise possessed the clarity of logic. The labyrinth was not escaped; it was merely postponed. I dressed. I emptied my pockets. The objects appeared insignificant: the watch, the chain, the notebook, the revolver.\n\nOne bullet. The plan formed not from courage, but from elimination. There was only one way to shout a name loudly enough."
  },
  {
    "NODE_ID": "A04",
    "NODE_TYPE": "canon",
    "TEXT": "I SAID ALOUD, \"I MUST FLEE.\" \n\nI SAT UP ON THE BED, IN SENSELESS AND PERFECT SILENCE, AS IF MADDEN WAS ALREADY PEERING AT ME. SOMETHING - PERHAPS MERELY A DESIRE TO PROVE MY TOTAL PENURY TO MYSELF - MADE ME EMPTY OUT MY POCKETS. I FOUND JUST WHAT I KNEW I WAS GOING TO FIND. THE AMERICAN WATCH, THE NICKEL-PLATED CHAIN AND THE SQUARE COIN, THE KEY RING WITH THE USELESS BUT COMPROMISING KEYS TO RUNEBERG'S OFFICE, THE NOTEBOOK, A LETTER WHICH I DECIDED TO DESTROY AT ONCE (AND WHICH I DID NOT DESTROY), A FIVE SHILLING PIECE, TWO SINGLE SHILLINGS AND SOME PENNIES, A RED AND BLUE PENCIL, A HANDKERCHIEF - AND A REVOLVER WITH A SINGLE BULLET. ABSURDLY I HELD IT AND WEIGHED IT IN MY HAND, TO GIVE MYSELF COURAGE. VAGUELY I THOUGHT THAT A PISTOL SHOT CAN BE HEARD FOR A GREAT DISTANCE. \n\nIN TEN MINUTES I HAD DEVELOPED MY PLAN. THE TELEPHONE DIRECTORY GAVE ME THE NAME OF THE ONE PERSON CAPABLE OF PASSING ON THE INFORMATION. HE LIVED IN A SUBURB OF FENTON, LESS THAN HALF AN HOUR AWAY BY TRAIN. \n\nI AM A TIMOROUS MAN. I CAN SAY IT NOW, NOW THAT I HAVE BROUGHT MY INCREDIBLY RISKY PLAN TO AN END. IT WAS NOT EASY TO BRING ABOUT, AND I KNOW THAT ITS EXECUTION WAS TERRIBLE. I DID NOT DO IT FOR GERMANY - NO! SUCH A BARBAROUS COUNTRY IS OF NO IMPORTANCE TO ME, PARTICULARLY SINCE IT HAD DEGRADED ME BY MAKING ME BECOME A SPY. FURTHERMORE, I KNEW AN ENGLISHMAN - A MODEST MAN - WHO, FOR ME, IS AS GREAT AS GOETHE. I DID NOT SPEAK WITH HIM FOR MORE THAN AN HOUR, BUT DURING THAT TIME, HE WAS GOETHE. \n\nI CARRIED OUT MY PLAN BECAUSE I FELT THE CHIEF HAD SOME FEAR OF THOSE OF MY RACE, OF THOSE UNCOUNTABLE FOREBEARS WHOSE CULMINATION LIES IN ME. I WISHED TO PROVE TO HIM THAT A YELLOW MAN COULD SAVE HIS ARMIES. BESIDES, I HAD TO ESCAPE THE CAPTAIN. HIS HANDS AND VOICE COULD, AT ANY MOMENT, KNOCK AND BECKON AT MY DOOR."
  },
  {
    "NODE_ID": "A05",
    "NODE_TYPE": "canon",
    "TEXT": "SILENTLY, I DRESSED, TOOK LEAVE OF MYSELF IN THE MIRROR, WENT DOWN THE STAIRS, SNEAKED A LOOK AT THE QUIET STREET, AND WENT OUT. THE STATION WAS NOT FAR FROM MY HOUSE, BUT I THOUGHT IT MORE PRUDENT TO TAKE A CAB. I TOLD MYSELF THAT I THUS RAN LESS CHANCE OF BEING RECOGNIZED. THE TRUTH IS THAT, IN THE DESERTED STREET, I FELT INFINITELY VISIBLE AND VULNERABLE. \n\nI RECALL THAT I TOLD THE DRIVER TO STOP SHORT OF THE MAIN ENTRANCE. I GOT OUT WITH A PAINFUL AND DELIBERATE SLOWNESS. \n\nI WAS GOING TO THE VILLAGE OF ASHGROVE, BUT TOOK A TICKET FOR A STATION FURTHER ON. THE TRAIN WOULD LEAVE IN A FEW MINUTES, AT EIGHT-FIFTY."
  },
  {
    "NODE_ID": "B_A05",
    "NODE_TYPE": "",
    "TEXT": "I THOUGHT IT MORE PRUDENT TO TAKE A CAB. I TOLD MYSELF THAT I THUS RAN LESS CHANCE OF BEING RECOGNIZED. THE TRUTH IS THAT, IN THE DESERTED STREET, I FELT INFINITELY VISIBLE AND VULNERABLE. \n\nI RECALL THAT I TOLD THE DRIVER TO STOP SHORT OF THE MAIN ENTRANCE. I GOT OUT WITH A PAINFUL AND DELIBERATE SLOWNESS. \n\nI WAS GOING TO THE VILLAGE OF ASHGROVE, BUT TOOK A TICKET FOR A STATION FURTHER ON. THE TRAIN WOULD LEAVE IN A FEW MINUTES, AT EIGHT-FIFTY."
  },
  {
    "NODE_ID": "A06",
    "NODE_TYPE": "canon",
    "TEXT": "I HURRIED, FOR THE NEXT WOULD NOT GO UNTIL HALF PAST NINE. THERE WAS ALMOST NO ONE ON THE PLATFORM. I WALKED THROUGH THE CARRIAGES. I REMEMBER SOME FARMERS, A WOMAN DRESSED IN MOURNING, A YOUTH DEEP IN TACITUS' ANNALS AND A WOUNDED, HAPPY SOLDIER. \n\nAT LAST THE TRAIN PULLED OUT. A MAN I RECOGNIZED RAN FURIOUSLY, BUT VAINLY, THE LENGTH OF THE PLATFORM."
  },
  {
    "NODE_ID": "A07",
    "NODE_TYPE": "canon",
    "TEXT": "IT WAS CAPTAIN RICHARD MADDEN. SHATTERED, TREMBLING, I HUDDLED IN THE DISTANT CORNER OF THE SEAT, AS FAR AS POSSIBLE FROM THE FEARFUL WINDOW. \n\nFROM UTTER TERROR I PASSED INTO A STATE OF ALMOST ABJECT HAPPINESS. I TOLD MYSELF THAT THE DUEL HAD ALREADY STARTED AND THAT I HAD WON THE FIRST ENCOUNTER BY BESTING MY ADVERSARY IN HIS FIRST ATTACK - EVEN IF IT WAS ONLY FOR FORTY MINUTES - BY AN ACCIDENT OF FATE. I ARGUED THAT SO SMALL A VICTORY PREFIGURED A TOTAL VICTORY. I ARGUED THAT IT WAS NOT SO TRIVIAL, THAT WERE IT NOT FOR THE PRECIOUS ACCIDENT OF THE TRAIN SCHEDULE, I WOULD BE IN PRISON OR DEAD. I ARGUED, WITH NO LESS SOPHISM, THAT MY TIMOROUS HAPPINESS WAS PROOF THAT I WAS MAN ENOUGH TO BRING THIS ADVENTURE TO A SUCCESSFUL CONCLUSION. FROM MY WEAKNESS I DREW STRENGTH THAT NEVER LEFT ME. \n\nI FORESEE THAT MAN WILL RESIGN HIMSELF EACH DAY TO NEW ABOMINATIONS, THAT SOON ONLY SOLDIERS AND BANDITS WILL BE LEFT. TO THEM I OFFER THIS ADVICE: WHOSOEVER WOULD UNDERTAKE SOME ATROCIOUS ENTERPRISE SHOULD ACT AS IF IT WERE ALREADY ACCOMPLISHED, SHOULD IMPOSE UPON HIMSELF A FUTURE AS IRREVOCABLE AS THE PAST."
  },
  {
    "NODE_ID": "A08",
    "NODE_TYPE": "canon",
    "TEXT": "THUS I PROCEEDED, WHILE WITH THE EYES OF A MAN ALREADY DEAD, I CONTEMPLATED THE FLUCTUATIONS OF THE DAY WHICH WOULD PROBABLY BE MY LAST, AND WATCHED THE DIFFUSE COMING OF NIGHT. \n\nTHE TRAIN CREPT ALONG GENTLY, AMID ASH TREES. IT SLOWED DOWN AND STOPPED, ALMOST IN THE MIDDLE OF A FIELD. NO ONE CALLED THE NAME OF A STATION."
  },
  {
    "NODE_ID": "A09",
    "NODE_TYPE": "canon",
    "TEXT": "ASHGROVE?\" I ASKED SOME CHILDREN ON THE PLATFORM. \n\n\"ASHGROVE,\" THEY REPLIED."
  },
  {
    "NODE_ID": "A10",
    "NODE_TYPE": "canon",
    "TEXT": "I GOT OUT. \n\nA LAMP LIT THE PLATFORM, BUT THE CHILDREN'S FACES REMAINED IN A SHADOW. ONE OF THEM ASKED ME: \"ARE YOU GOING TO DR. STEPHEN ALBERT'S HOUSE?\" WITHOUT WAITING FOR MY ANSWER, ANOTHER SAID: \"THE HOUSE IS A GOOD DISTANCE AWAY BUT YOU WON'T GET LOST IF YOU TAKE THE ROAD TO THE LEFT AND BEAR TO THE LEFT AT EVERY CROSSROAD."
  },
  {
    "NODE_ID": "A11",
    "NODE_TYPE": "canon",
    "TEXT": "I THREW THEM A COIN (MY LAST), WENT DOWN SOME STONE STEPS AND STARTED ALONG A DESERTED ROAD. AT A SLIGHT INCLINE, THE ROAD RAN DOWNHILL. IT WAS A PLAIN DIRT WAY, AND OVERHEAD THE BRANCHES OF TREES INTERMINGLED, WHILE A ROUND MOON HUNG LOW IN THE SKY AS IF TO KEEP ME COMPANY. \n\nFOR A MOMENT I THOUGHT THAT RICHARD MADDEN MIGHT IN SOME WAY HAVE DIVINED MY DESPERATE INTENT. AT ONCE I REALIZED THAT THIS WOULD BE IMPOSSIBLE. THE ADVICE ABOUT TURNING ALWAYS TO THE LEFT REMINDED ME THAT SUCH WAS THE COMMON FORMULA FOR FINDING THE CENTRAL COURTYARD OF CERTAIN LABYRINTHS. I KNOW SOMETHING ABOUT LABYRINTHS. \n\nNOT FOR NOTHING AM I THE GREATGRANDSON OF TS'UI PEN. HE WAS GOVERNOR OF YUNNAN AND GAVE UP TEMPORAL POWER TO WRITE A NOVEL WITH MORE CHARACTERS THAN THERE ARE IN THE HUNG LOU MENG, AND TO CREATE A MAZE IN WHICH ALL MEN WOULD LOSE THEMSELVES. HE SPENT THIRTEEN YEARS ON THESE ODDLY ASSORTED TASKS BEFORE HE WAS ASSASSINATED BY A STRANGER. HIS NOVEL HAD NO SENSE TO IT AND NOBODY EVER FOUND HIS LABYRINTH."
  },
  {
    "NODE_ID": "A12",
    "NODE_TYPE": "canon",
    "TEXT": "UNDER THE TREES OF ENGLAND I MEDITATED ON THIS LOST AND PERHAPS MYTHICAL LABYRINTH. I IMAGINED IT UNTOUCHED AND PERFECT ON THE SECRET SUMMIT OF SOME MOUNTAIN; I IMAGINED IT DROWNED UNDER RICE PADDIES OR BENEATH THE SEA; I IMAGINED IT INFINITE, MADE NOT ONLY OF EIGHT-SIDED PAVILIONS AND OF TWISTING PATHS BUT ALSO OF RIVERS, PROVINCES AND KINGDOMS ... I THOUGHT OF A MAZE OF MAZES, OF A SINUOUS, EVER GROWING MAZE WHICH WOULD TAKE IN BOTH PAST AND FUTURE AND WOULD SOMEHOW INVOLVE THE STARS. \n\nLOST IN THESE IMAGINARY ILLUSIONS I FORGOT MY DESTINY - THAT OF THE HUNTED. FOR AN UNDETERMINED PERIOD OF TIME I FELT MYSELF CUT OFF FROM THE WORLD, AN ABSTRACT SPECTATOR. THE HAZY AND MURMURING COUNTRYSIDE, THE MOON, THE DECLINE OF THE EVENING, STIRRED WITHIN ME."
  },
  {
    "NODE_ID": "A13",
    "NODE_TYPE": "canon",
    "TEXT": "GOING DOWN THE GENTLY SLOPING ROAD I COULD NOT FEEL FATIGUE. THE EVENING WAS AT ONCE INTIMATE AND INFINITE. THE ROAD KEPT DESCENDING AND BRANCHING OFF, THROUGH MEADOWS MISTY IN THE TWILIGHT. A HIGH-PITCHED AND ALMOST SYLLABIC MUSIC KEPT COMING AND GOING, MOVING WITH THE BREEZE, BLURRED BY THE LEAVES AND BY DISTANCE. \n\nI THOUGHT THAT A MAN MIGHT BE AN ENEMY OF OTHER MEN, OF THE DIFFERING MOMENTS OF OTHER MEN, BUT NEVER AN ENEMY OF A COUNTRY: NOT OF FIREFLIES, WORDS, GARDENS, STREAMS, OR THE WEST WIND. \n\nMEDITATING THUS I ARRIVED AT A HIGH, RUSTY IRON GATE. THROUGH THE RAILINGS I COULD SEE AN AVENUE BORDERED WITH POPLAR TREES AND ALSO A KIND OF SUMMER HOUSE OR PAVILION. TWO THINGS DAWNED ON ME AT ONCE, THE FIRST TRIVIAL AND THE SECOND ALMOST INCREDIBLE: THE MUSIC CAME FROM THE PAVILION AND THAT MUSIC WAS CHINESE."
  },
  {
    "NODE_ID": "A14",
    "NODE_TYPE": "canon",
    "TEXT": "THAT WAS WHY I HAD ACCEPTED IT FULLY, WITHOUT PAYING IT ANY ATTENTION. I DO NOT REMEMBER WHETHER THERE WAS A BELL, A PUSH-BUTTON, OR WHETHER I ATTRACTED ATTENTION BY CLAPPING MY HANDS. THE STUTTERING SPARKS OF THE MUSIC KEPT ON. \n\nBUT FROM THE END OF THE AVENUE, FROM THE MAIN HOUSE, A LANTERN APPROACHED; A LANTERN WHICH ALTERNATELY, FROM MOMENT TO MOMENT, WAS CRISSCROSSED OR PUT OUT BY THE TRUNKS OF THE TREES; A PAPER LANTERN SHAPED LIKE A DRUM AND COLORED LIKE THE MOON. A TALL MAN CARRIED IT. \n\nI COULD NOT SEE HIS FACE FOR THE LIGHT BLINDED ME. \n\nHE OPENED THE GATE AND SPOKE SLOWLY IN MY LANGUAGE. \n\n\"I SEE THAT THE WORTHY HSI P'ENG HAS TROUBLED HIMSELF TO SEE TO RELIEVING MY SOLITUDE. NO DOUBT YOU WANT TO SEE THE GARDEN?\" \n\nRECOGNIZING THE NAME OF ONE OF OUR CONSULS, I REPLIED, SOMEWHAT TAKEN ABACK."
  },
  {
    "NODE_ID": "A15",
    "NODE_TYPE": "canon",
    "TEXT": "THE GARDEN?\" \n\n\"THE GARDEN OF FORKING PATHS.\" \n\nSOMETHING STIRRED IN MY MEMORY AND I SAID, WITH INCOMPREHENSIBLE ASSURANCE:"
  },
  {
    "NODE_ID": "A16",
    "NODE_TYPE": "canon",
    "TEXT": "THE GARDEN OF MY ANCESTOR, TS'UI PEN.\" \n\n\"YOUR ANCESTOR? YOUR ILLUSTRIOUS ANCESTOR? COME IN.\" \n\nTHE DAMP PATH ZIGZAGGED LIKE THOSE OF MY CHILDHOOD. WHEN WE REACHED THE HOUSE, WE WENT INTO A LIBRARY FILLED WITH BOOKS FROM BOTH EAST AND WEST."
  },
  {
    "NODE_ID": "A17",
    "NODE_TYPE": "canon",
    "TEXT": "I RECOGNIZED SOME LARGE VOLUMES BOUND IN YELLOW SILK-MANUSCRIPTS OF THE LOST ENCYCLOPEDIA WHICH WAS EDITED BY THE THIRD EMPEROR OF THE LUMINOUS DYNASTY. THEY HAD NEVER BEEN PRINTED. A PHONOGRAPH RECORD WAS SPINNING NEAR A BRONZE PHOENIX. I REMEMBER ALSO A ROSE-GLAZED JAR AND YET ANOTHER, OLDER BY MANY CENTURIES, OF THAT BLUE COLOR WHICH OUR POTTERS COPIED FROM THE PERSIANS . . . \n\nSTEPHEN ALBERT WAS WATCHING ME WITH A SMILE ON HIS FACE. HE WAS, AS I HAVE SAID, REMARKABLY TALL. HIS FACE WAS DEEPLY LINED AND HE HAD GRAY EYES AND A GRAY BEARD. THERE WAS ABOUT HIM SOMETHING OF THE PRIEST, AND SOMETHING OF THE SAILOR. LATER, HE TOLD ME HE HAD BEEN A MISSIONARY IN TIENTSIN BEFORE HE \"HAD ASPIRED TO BECOME A SINOLOGIST.\"\n\nWE SAT DOWN, I UPON A LARGE, LOW DIVAN, HE WITH HIS BACK TO THE WINDOW AND TO A LARGE CIRCULAR CLOCK. I CALCULATED THAT MY PURSUER, RICHARD MADDEN, COULD NOT ARRIVE IN LESS THAN AN HOUR. MY IRREVOCABLE DECISION COULD WAIT. \n\n\"A STRANGE DESTINY,\" SAID STEPHEN ALBERT, \"THAT OF TS'UI PEN - GOVERNOR OF HIS NATIVE PROVINCE, LEARNED IN ASTRONOMY, IN ASTROLOGY AND TIRELESS IN THE INTERPRETATION OF THE CANONICAL BOOKS, A CHESS PLAYER, A FAMOUS POET AND A CALLIGRAPHER. YET HE ABANDONED ALL TO MAKE A BOOK AND A LABYRINTH. HE GAVE UP ALL THE PLEASURES OF OPPRESSION, JUSTICE, OF A WELL-STOCKED BED, OF BANQUETS, AND EVEN OF ERUDITION, AND SHUT HIMSELF UP IN THE PAVILION OF THE LIMPID SUN FOR THIRTEEN YEARS. AT HIS DEATH, HIS HEIRS FOUND ONLY A MESS OF MANUSCRIPTS. THE FAMILY, AS YOU DOUBTLESS KNOW, WISHED TO CONSIGN THEM TO THE FIRE, BUT THE EXECUTOR OF THE ESTATE - A TAOIST OR A BUDDHIST MONK - INSISTED ON THEIR PUBLICATION."
  },
  {
    "NODE_ID": "A18",
    "NODE_TYPE": "canon",
    "TEXT": "THOSE OF THE BLOOD OF TS'UI PEN,\" I REPLIED, \"STILL CURSE THE MEMORY OF THAT MONK. SUCH A PUBLICATION WAS MADNESS. THE BOOK IS A SHAPELESS MASS OF CONTRADICTORY ROUGH DRAFTS. I EXAMINED IT ONCE UPON A TIME: THE HERO DIES IN THE THIRD CHAPTER, WHILE IN THE FOURTH HE IS ALIVE. AS FOR THAT OTHER ENTERPRISE OF TS'UI PEN … HIS LABYRINTH . . .\" \n\n\"HERE IS THE LABYRINTH,\" ALBERT SAID, POINTING TO A TALL, LAQUERED WRITING CABINET."
  },
  {
    "NODE_ID": "A19",
    "NODE_TYPE": "canon",
    "TEXT": "AN IVORY LABYRINTH?\" I EXCLAIMED. \"A TINY LABYRINTH INDEED . . . !\" \n\n\"A SYMBOLIC LABYRINTH,\" HE CORRECTED ME. \"AN INVISIBLE LABYRINTH OF TIME. I, A BARBAROUS ENGLISHMAN, HAVE BEEN GIVEN THE KEY TO THIS TRANSPARENT MYSTERY. AFTER MORE THAN A HUNDRED YEARS MOST OF THE DETAILS ARE IRRECOVERABLE, LOST BEYOND ALL RECALL, BUT IT ISN'T HARD TO IMAGE WHAT MUST HAVE HAPPENED. AT ONE TIME, TS'UI PEN MUST HAVE SAID; 'I AM GOING INTO SECLUSION TO WRITE A BOOK,' AND AT ANOTHER, 'I AM RETIRING TO CONSTRUCT A MAZE.' EVERYONE ASSUMED THESE WERE SEPARATE ACTIVITIES. NO ONE REALIZED THAT THE BOOK AND THE LABYRINTH WERE ONE AND THE SAME. THE PAVILION OF THE LIMPID SUN WAS SET IN THE MIDDLE OF AN INTRICATE GARDEN. THIS MAY HAVE SUGGESTED THE IDEA OF A PHYSICAL MAZE. \n\n\"TS'UI PEN DIED. IN ALL THE VAST LANDS WHICH ONCE BELONGED TO YOUR FAMILY, NO ONE COULD FIND THE LABYRINTH. THE NOVEL'S CONFUSION SUGGESTED THAT IT WAS THE LABYRINTH. \n\nTWO CIRCUMSTANCES SHOWED ME THE DIRECT SOLUTION TO THE PROBLEM. FIRST, THE CURIOUS LEGEND THAT TS'UI PEN HAD PROPOSED TO CREATE AN INFINITE MAZE, SECOND, A FRAGMENT OF A LETTER WHICH I DISCOVERED.\" \n\nALBERT ROSE. FOR A FEW MOMENTS HE TURNED HIS BACK TO ME."
  },
  {
    "NODE_ID": "A20",
    "NODE_TYPE": "canon",
    "TEXT": "HE OPENED THE TOP DRAWER IN THE HIGH BLACK AND GILDED WRITING CABINET. HE RETURNED HOLDING IN HIS HAND A PIECE OF PAPER WHICH HAD ONCE BEEN CRIMSON BUT WHICH HAD FADED WITH THE PASSAGE OF TIME: IT WAS ROSE COLORED, TENUOUS, QUADRANGULAR. TS'UI PEN'S CALLIGRAPHY WAS JUSTLY FAMOUS. EAGERLY, BUT WITHOUT UNDERSTANDING, I READ THE WORDS WHICH A MAN OF MY OWN BLOOD HAD WRITTEN WITH A SMALL BRUSH: \"I LEAVE TO VARIOUS FUTURE TIMES,BUT NOT TO ALL, MY GARDEN OF FORKING PATHS."
  },
  {
    "NODE_ID": "A21",
    "NODE_TYPE": "canon",
    "TEXT": "I HANDED BACK THE SHEET OF PAPER IN SILENCE. ALBERT WENT ON: \n\n\"BEFORE I DISCOVERED THIS LETTER, I KEPT ASKING MYSELF HOW A BOOK COULD BE INFINITE. I COULD NOT IMAGINE ANY OTHER THAN A CYCLIC VOLUME, CIRCULAR. A VOLUME WHOSE LAST PAGE WOULD BE THE SAME AS THE FIRST AND SO HAVE THE POSSIBILITY OF CONTINUING INDEFINITELY. I RECALLED, TOO, THE NIGHT IN THE MIDDLE OF THE THOUSAND AND ONE NIGHTS WHEN QUEEN SCHEHEREZADE, THROUGH A MAGICAL MISTAKE ON THE PART OF HER COPYIST, STARTED TO TELL THE STORY OF THE THOUSAND AND ONE NIGHTS, WITH THE RISK OF AGAIN ARRIVING AT THE NIGHT UPON WHICH SHE WILL RELATE IT, AND THUS ON TO INFINITY. I ALSO IMAGINED A PLATONIC HEREDITARY WORK, PASSED ON FROM FATHER TO SON, TO WHICH EACH INDIVIDUAL WOULD ADD A NEW CHAPTER OR CORRECT, WITH PIOUS CARE, THE WORK OF HIS ELDERS. \n\n\"THESE CONJECTURES GAVE ME AMUSEMENT, BUT NONE SEEMED TO HAVE THE REMOTEST APPLICATION TO THE CONTRADICTORY CHAPTERS OF TS'UI PEN. AT THIS POINT, I WAS SENT FROM OXFORD THE MANUSCRIPT YOU HAVE JUST SEEN. \n\n\"NATURALLY, MY ATTENTION WAS CAUGHT BY THE SENTENCE, 'I LEAVE TO VARIOUS FUTURE TIMES, BUT NOT TO ALL, MY GARDEN OF FORKING PATHS: I HAD NO SOONER READ THIS, THAN I UNDERSTOOD. THE GARDEN OF FORKING PATHS WAS THE CHAOTIC NOVEL ITSELF. THE PHRASE 'TO VARIOUS FUTURE TIMES, BUT NOT TO ALL' SUGGESTED THE IMAGE OF BIFURCATING IN TIME, NOT IN SPACE. REREADING THE WHOLE WORK CONFIRMED THIS THEORY. \n\nIN ALL FICTION, WHEN A MAN IS FACED WITH ALTERNATIVES HE CHOOSES ONE AT THE EXPENSE OF THE OTHERS. IN THE ALMOST UNFATHOMABLE TS'UI PEN, HE CHOOSES - SIMULTANEOUSLY - ALL OF THEM. HE THUS CREATES VARIOUS FUTURES, VARIOUS TIMES WHICH START OTHERS THAT WILL IN THEIR TURN BRANCH OUT AND BIFURCATE IN OTHER TIMES. THIS IS THE CAUSE OF THE CONTRADICTIONS IN THE NOVEL."
  },
  {
    "NODE_ID": "A21.5",
    "NODE_TYPE": "canon",
    "TEXT": "FANG, LET US SAY, HAS A SECRET. A STRANGER KNOCKS AT HIS DOOR. FANG MAKES UP HIS MIND TO KILL HIM. NATURALLY THERE ARE VARIOUS POSSIBLE OUTCOMES. FANG CAN KILL THE INTRUDER, THE INTRUDER CAN KILL FANG, BOTH CAN BE SAVED, BOTH CAN DIE AND SO ON AND SO ON. IN TS'UI PEN'S WORK, ALL THE POSSIBLE SOLUTIONS OCCUR, EACH ONE BEING THE POINT OF DEPARTURE FOR OTHER BIFURCATIONS. SOMETIMES THE PATHWAYS OF THIS LABYRINTH CONVERGE. FOR EXAMPLE, YOU COME TO THIS HOUSE; BUT IN OTHER POSSIBLE PASTS YOU ARE MY ENEMY; IN OTHERS MY FRIEND. \n\n\"IF YOU WILL PUT UP WITH MY ATROCIOUS PRONUNCIATION, I WOULD LIKE TO READ YOU A FEW PAGES OF YOUR ANCESTOR'S WORK.\" \n\nHIS COUNTENANCE, IN THE BRIGHT CIRCLE OF LAMPLIGHT, WAS CERTAINLY THAT OF AN ANCIENT, BUT IT SHONE WITH SOMETHING UNYIELDING, EVEN IMMORTAL. \n\nWITH SLOW PRECISION, HE READ TWO VERSIONS OF THE SAME EPIC CHAPTER. IN THE FIRST, AN ARMY MARCHES INTO BATTLE OVER A DESOLATE MOUNTAIN PASS. THE BLEAK AND SOMBER ASPECT OF THE ROCKY LANDSCAPE MADE THE SOLDIERS FEEL THAT LIFE ITSELF WAS OF LITTLE VALUE, AND SO THEY WON THE BATTLE EASILY. IN THE SECOND, THE SAME ARMY PASSES THROUGH A PALACE WHERE A BANQUET IS IN PROGRESS. THE SPLENDOR OF THE FEAST REMAINED A MEMORY THROUGHOUT THE GLORIOUS BATTLE, AND SO VICTORY FOLLOWED. \n\nWITH PROPER VENERATION I LISTENED TO THESE OLD TALES, ALTHOUGH PERHAPS WITH LESS ADMIRATION FOR THEM IN THEMSELVES THAN FOR THE FACT THAT THEY HAD BEEN THOUGHT OUT BY ONE OF MY OWN BLOOD, AND THAT A MAN OF A DISTANT EMPIRE HAD GIVEN THEM BACK TO ME, IN THE LAST STAGE OF A DESPERATE ADVENTURE, ON A WESTERN ISLAND. \n\nI REMEMBER THE FINAL WORDS, REPEATED AT THE END OF EACH VERSION LIKE A SECRET COMMAND: \"THUS THE HEROES FOUGHT, WITH TRANQUIL HEART AND BLOODY SWORD. THEY WERE RESIGNED TO KILLING AND TO DYING."
  },
  {
    "NODE_ID": "A22",
    "NODE_TYPE": "canon",
    "TEXT": "AT THAT MOMENT I FELT WITHIN ME AND AROUND ME SOMETHING INVISIBLE AND INTANGIBLE PULLULATING. IT WAS NOT THE PULLULATION OF TWO DIVERGENT, PARALLEL, AND FINALLY CONVERGING ARMIES, BUT AN AGITATION MORE INACCESSIBLE, MORE INTIMATE, PREFIGURED BY THEM IN SOME WAY. STEPHEN ALBERT CONTINUED: \n\n\"I DO NOT THINK THAT YOUR ILLUSTRIOUS ANCESTOR TOYED IDLY WITH VARIATIONS. I DO NOT FIND IT BELIEVABLE THAT HE WOULD WASTE THIRTEEN YEARS LABORING OVER A NEVER ENDING  EXPERIMENT IN RHETORIC. IN YOUR COUNTRY THE NOVEL IS AN INFERIOR GENRE; IN TS'UI PEN'S PERIOD, IT WAS A DESPISED ONE. TS'UI PEN WAS A FINE NOVELIST BUT HE WAS ALSO A MAN OF LETTERS WHO, DOUBTLESS, CONSIDERED HIMSELF MORE THAN A MERE NOVELIST. THE TESTIMONY OF HIS CONTEMPORARIES ATTESTS TO THIS, AND CERTAINLY THE KNOWN FACTS OF HIS LIFE CONFIRM HIS LEANINGS TOWARD THE METAPHYSICAL AND THE MYSTICAL. PHILOSOPHICAL CONJECTURES TAKE UP THE GREATER PART OF HIS NOVEL. I KNOW THAT OF ALL PROBLEMS, NONE DISQUIETED HIM MORE, AND NONE CONCERNED HIM MORE THAN THE PROFOUND ONE OF TIME. NOW THEN, THIS IS THE ONLY PROBLEM THAT DOES NOT FIGURE IN THE PAGES OF THE GARDEN. HE DOES NOT EVEN USE THE WORD WHICH MEANS TIME. HOW CAN THESE VOLUNTARY OMISSIONS BE EXPLAINED?"
  },
  {
    "NODE_ID": "A23",
    "NODE_TYPE": "canon",
    "TEXT": "I PROPOSED VARIOUS SOLUTIONS, ALL OF THEM INADEQUATE. WE DISCUSSED THEM. \n\nFINALLY, STEPHEN ALBERT SAID: \"IN A GUESSING GAME TO WHICH THE ANSWER IS CHESS, WHICH WORD IS THE ONLY ONE PROHIBITED?\" \n\nI THOUGHT FOR A MOMENT AND THEN REPLIED:"
  },
  {
    "NODE_ID": "A24",
    "NODE_TYPE": "canon",
    "TEXT": "THE WORD IS CHESS.\" \n\n\"PRECISELY,\" SAID ALBERT. \"THE GARDEN OF FORKING PATHS IS AN ENORMOUS GUESSING GAME, OR PARABLE, IN WHICH THE SUBJECT IS TIME. THE RULES OF THE GAME FORBID THE USE OF THE WORD ITSELF. TO ELIMINATE A WORD COMPLETELY, TO REFER TO IT BY MEANS OF INEPT PHRASES  AND OBVIOUS PARAPHRASES, IS PERHAPS THE BEST WAY OF DRAWING ATTENTION TO IT. THIS, THEN, IS THE TORTUOUS METHOD OF APPROACH PREFERRED BY THE OBLIQUE TS'UI PEN IN EVERY MEANDERING OF HIS INTERMINABLE NOVEL. I HAVE GONE OVER HUNDREDS OF MANUSCRIPTS, I HAVE CORRECTED ERRORS INTRODUCED BY CARELESS COPYISTS, I HAVE WORKED OUT THE PLAN FROM THIS CHAOS, I HAVE RESTORED, OR BELIEVE I HAVE RESTORED, THE ORIGINAL. I HAVE TRANSLATED THE WHOLE WORK. I CAN STATE CATEGORICALLY THAT NOT ONCE HAS THE WORD TIME BEEN USED IN THE WHOLE BOOK. \n\n\"THE EXPLANATION IS OBVIOUS. THE GARDEN OF FORKING PATHS IS A PICTURE, INCOMPLETE YET NOT FALSE, OF THE UNIVERSE SUCH AS TS'UI PEN CONCEIVED IT TO BE. DIFFERING FROM NEWTON AND SCHOPENHAUER, YOUR ANCESTOR DID NOT THINK OF TIME AS ABSOLUTE AND UNIFORM. HE BELIEVED IN AN INFINITE SERIES OF TIMES, IN A DIZZILY GROWING, EVER SPREADING NETWORK OF DIVERGING, CONVERGING AND PARALLEL TIMES. THIS WEB OF TIME - THE STRANDS OF WHICH APPROACH ONE ANOTHER, BIFURCATE, INTERSECT OR IGNORE EACH OTHER THROUGH THE CENTURIES - EMBRACES EVERY POSSIBILITY. WE DO NOT EXIST IN MOST OF THEM. IN SOME YOU EXIST AND NOT I, WHILE IN OTHERS I DO, AND YOU DO NOT, AND IN YET OTHERS BOTH OF US EXIST. IN THIS ONE, IN WHICH CHANCE HAS FAVORED ME, YOU HAVE COME TO MY GATE. IN ANOTHER, YOU, CROSSING THE GARDEN, HAVE FOUND ME DEAD. IN YET ANOTHER, I SAY THESE VERY SAME WORDS, BUT AM AN ERROR, A PHANTOM."
  },
  {
    "NODE_ID": "A25",
    "NODE_TYPE": "canon",
    "TEXT": "IN ALL OF THEM,\" I ENUNCIATED, WITH A TREMOR IN MY VOICE. \"I DEEPLY APPRECIATE AND AM GRATEFUL TO YOU FOR THE RESTORATION OF TS'UI PEN'S GARDEN.\" \n\n\"NOT IN ALL,\" HE MURMURED WITH A SMILE. \"TIME IS FOREVER DIVIDING ITSELF TOWARD INNUMERABLE FUTURES AND IN ONE OF THEM I AM YOUR ENEMY.\" \n\nONCE AGAIN I SENSED THE PULLULATION OF WHICH I HAVE ALREADY SPOKEN. IT SEEMED TO ME THAT THE DEW-DAMP GARDEN SURROUNDING THE HOUSE WAS INFINITELY SATURATED WITH INVISIBLE PEOPLE. ALL WERE ALBERT AND MYSELF, SECRETIVE, BUSY AND MULTIFORM IN OTHER DIMENSIONS OF TIME. I LIFTED MY EYES AND THE SHORT NIGHTMARE DISAPPEARED. \n\nIN THE BLACK AND YELLOW GARDEN THERE WAS ONLY A SINGLE MAN, BUT THIS MAN WAS AS STRONG AS A STATUE AND THIS MAN WAS WALKING UP THE PATH AND HE WAS CAPTAIN RICHARD MADDEN."
  },
  {
    "NODE_ID": "A26",
    "NODE_TYPE": "canon",
    "TEXT": "THE FUTURE EXISTS NOW,\" I REPLIED. \"BUT I AM YOUR FRIEND. CAN I TAKE ANOTHER LOOK AT THE LETTER?\" \n\nALBERT ROSE FROM HIS SEAT. HE STOOD UP TALL AS HE OPENED THE TOP DRAWER OF THE HIGH WRITING CABINET. FOR A MOMENT HIS BACK WAS AGAIN TURNED TO ME. I HAD THE REVOLVER READY."
  },
  {
    "NODE_ID": "A27",
    "NODE_TYPE": "canon",
    "TEXT": "I FIRED WITH THE UTMOST CARE: ALBERT FELL WITHOUT A MURMUR, AT ONCE. I SWEAR THAT HIS DEATH WAS INSTANTANEOUS, AS IF HE HAD BEEN STRUCK BY LIGHTNING. \n\nWHAT REMAINS IS UNREAL AND UNIMPORTANT. MADDEN BROKE IN AND ARRESTED ME. I HAVE BEEN CONDEMNED TO HANG. ABOMINABLY, I HAVE YET TRIUMPHED! THE SECRET NAME OF THE CITY TO BE ATTACKED GOT THROUGH TO BERLIN. YESTERDAY IT WAS BOMBED. I READ THE NEWS IN THE SAME ENGLISH NEWSPAPERS WHICH WERE TRYING TO SOLVE THE RIDDLE OF THE MURDER OF THE LEARNED SINOLOGIST STEPHEN ALBERT BY THE UNKNOWN YU TSUN. THE CHIEF, HOWEVER, HAD ALREADY SOLVED THIS MYSTERY. HE KNEW THAT MY PROBLEM WAS TO SHOUT, WITH MY FEEBLE VOICE, ABOVE THE TUMULT OF WAR, THE NAME OF THE CITY CALLED ALBERT, AND THAT I HAD NO OTHER COURSE OPEN TO ME THAN TO KILL SOMEONE OF THAT NAME. HE DOES NOT KNOW, FOR NO ONE CAN, OF MY INFINITE PENITENCE AND SICKNESS OF THE HEART."
  },
  {
    "NODE_ID": "F_A26",
    "NODE_TYPE": "Major Branch",
    "TEXT": "I DID NOT RAISE THE REVOLVER.\n\nALBERT’S BACK WAS TURNED. THE DRAWER WAS OPEN. THE ROSE-COLORED PAPER RESTED IN HIS HAND. OUTSIDE, THE GRAVEL GAVE A FAINT AND DELIBERATE SOUND BENEATH THE APPROACHING STEPS OF CAPTAIN RICHARD MADDEN.\n\nIT OCCURRED TO ME THAT I MIGHT YET DEPART WITHOUT BLOOD.\n\nWITHOUT A WORD, I MOVED TOWARD THE DOOR.\n\nALBERT, ABSORBED IN HIS MANUSCRIPTS, DID NOT NOTICE. THE GARDEN AIR RECEIVED ME WITH A STRANGE SERENITY. MADDEN SAW ME AT ONCE. HIS EXPRESSION ALTERED — NOT WITH SURPRISE, BUT WITH RECOGNITION.\n\nHE CALLED MY NAME.\n\nTHERE WAS NO TIME FOR HESITATION. I TURNED AND RAN BACK INTO THE HOUSE.\n\nALBERT LOOKED UP, STARTLED.\n\nTHE SOLDIER’S STEPS WERE ALREADY UPON THE THRESHOLD.\n\nI STOOD BETWEEN THE CABINET AND THE DOOR.\n\nTHE REVOLVER WAS IN MY HAND."
  },
  {
    "NODE_ID": "F_A26_02",
    "NODE_TYPE": "Major Branch",
    "TEXT": "“ALBERT,” I SAID, AND MY VOICE WAS UNSTEADY. “YOU MUST LISTEN TO ME.”\n\nHE REGARDED ME WITH GRAVE ATTENTION.\n\n“I AM NOT WHAT YOU SUPPOSE. I CAME HERE NOT AS A VISITOR, NOR AS A STUDENT OF YOUR RESTORATION. I CAME BECAUSE YOUR NAME — YOUR NAME ALONE — CAN SERVE AS A SIGNAL.”\n\nHE DID NOT INTERRUPT ME.\n\nOUTSIDE, MADDEN’S STEPS ADVANCED ACROSS THE GARDEN.\n\nI SPOKE RAPIDLY NOW. I TOLD HIM OF THE ARTILLERY PARK. OF BERLIN. OF THE NECESSITY OF MAKING A NAME RESOUND ACROSS CONTINENTS. I TOLD HIM THAT HE HAD BEEN CHOSEN BY ACCIDENT — OR BY SOMETHING MORE INTRICATE THAN ACCIDENT.\n\nALBERT LISTENED.\n\nHIS FACE ALTERED — NOT IN ANGER, NOR IN FEAR, BUT IN COMPREHENSION.\n\n“SO,” HE SAID AT LAST, “YOU INTEND TO KILL ME IN ORDER TO PRONOUNCE MY NAME.”\n\nTHERE WAS NO ACCUSATION IN HIS TONE. ONLY CLARITY.\n\nBEHIND HIM, THROUGH THE OPEN DOOR, I SAW MADDEN’S SHADOW APPROACH.\n\nTHE INTERVAL HAD GROWN INTOLERABLY SMALL."
  },
  {
    "NODE_ID": "F_A26_02A",
    "NODE_TYPE": "Major Branch",
    "TEXT": "“I DID NOT WISH THIS,” I SAID. “BELIEVE ME.”\n\nALBERT INCLINED HIS HEAD.\n\n“I DO BELIEVE YOU,” HE REPLIED.\n\nIT WAS NOT REPROACH THAT I SAW IN HIS EYES, BUT SOMETHING ALMOST SCHOLARLY — AS IF HE HAD DISCOVERED, AT LAST, THE FINAL CHAPTER OF HIS ANCESTOR’S LABYRINTH.\n\nMADDEN’S STEP CROSSED THE THRESHOLD.\n\nTHERE WAS NO FURTHER INTERVAL IN WHICH TO DELIBERATE.\n\nTHE REVOLVER REMAINED IN MY HAND."
  }
]